Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/losing_your_job/losing_job_entitlements.html.txt.tmx
Source language: en
Languages: ga

source: Losing your job - entitlements
ga: Do phost a chailliúint - teidlíochtaí

source: If you are being dismissed from your job or made redundant you may have certain entitlements including notice and pay for annual leave earned but not taken
ga: Má bhriseadh thú as do phost nó má d’fhágadh iomarcach thú, d’fhéadfá teidlíochtaí áirithe a bheith agat lena n-áirítear fógra agus pá le haghaidh saoire bhliantúil atá tuilte agat ach nár ghlac tú

source: This is a checklist of what your employer must give you when you leave work:
ga: Seo seicliosta cibé nach mór d’fhostóir a thabhairt duit nuair a fhágann tú obair:

source: • P45 – a statement of your pay and deductions – see ‘P45’ below
ga: • P45 – ráiteas do phá agus asbhaintí – féach ‘P45’ thíos

source: • Pay that you are owed for work you have done – see ‘Pay’ below
ga: • Pá a ndlitear duit as aon obair curtha i gcrích agat – féach ‘Pá’ thíos

source: • Payslip – showing your gross pay and any deductions
ga: • Pádhuille a thaispeánann an pá comhlán agus sonraí gach asbhaint

source: • Payment for annual leave which you have earned but not taken – see ‘Holiday pay’ below
ga: • Pá le haghaidh saoire bhliantúil atá tuilte agat ach nár ghlac tú – féach ‘Pá saoire’ thíos

source: • Payment instead of notice if you have not worked your notice period – see ‘Notice’ below
ga: • Pá in áit fhógra scoir mura n-oibríonn tú ar feadh na tréimhse fógra scoir – féach ‘Fógra scoir’ thíos

source: • Information about what happens to your pension scheme if applicable
ga: • Faisnéis maidir le cad a tharlaíonn do do phinsean má bhaineann sé leat

source: When you leave your job your employer must give you a P45
ga: Má fhágann tú d'fhostaíocht caithfidh d'fhostóir P45 a thabhairt duit

source: This is a statement of your pay and the tax, Universal Social Charge (USC) and PRSI to date deducted by your employer
ga: Seo ráiteas ar do phá agus ar an gcáin, Muirir Sóisialta Uilíoch agus ÁSPC asbhainte ag d'fhostóir go dtí sin

source: It is a very important document and you need it if:
ga: Is doiciméad an-tábhachtach atá ann agus tá sé ag teastáil:

source: • You are starting a new job – to give to your new employer in order to avoid paying emergency tax
ga: • Má tá tú ag tosú poist nua – le tabhairt do d'fhostóir nua chun íocaíocht ar cháin éigeandála a sheachaint

source: • You are unemployed – to claim a tax refund, to claim social welfare benefits
ga: • Má tá tú dífhostaithe – chun aisíoc cánach a éileamh, chun sochair leasa shóisialta a éileamh

source: The date on your P45 is the date that you physically leave the job
ga: Is ionann an dáta ar do P45 agus an dáta a fágann tú do phost go fisiciúil

source: For tax and social welfare purposes your employment has ceased
ga: Chun críocha cánach agus leasa shóisialaigh tá deireadh tagtha le d’fhostaíocht

source: Under employment law, the termination date of your employment may be different – see ‘Payment instead of notice’ below
ga: Faoin dlí fostaíochta, d’fhéadfadh dáta foirceannta d’fhostaíochta a bheith difriúil – féach ‘Íocaíocht in ionad fógra’ thíos

source: If your employer does not give you a P45 you should ask for it – see ‘How to apply’ below
ga: Mura dtugann d'fhostóir P45 duit ba chóir duit é a iarraidh - féach 'Conas iarratas a dhéanamh' thíos

source: You may be entitled to notice if you are being let go from your job
ga: D'fhéadfadh sé go mbeadh tú i dteideal fógra scoir má tá tú le bheith ligthe ag imeacht ó do phost

source: This means that you are given notice that your job will end, and a date in the near future when this will come into effect
ga: Tugtar fógra duit go mbeidh deireadh ag teacht le do chuid fostaíochta agus dáta luath go maith ina dhiaidh sin luaite leis

source: The length of notice you are entitled to, will depend in the first place on your contract of employment
ga: Braitheann fad an fhógra scoir ar do chonradh fostaíochta ar an gcéad dul síos

source: In addition, there is a minimum entitlement set out in the Minimum Notice and Terms of Employment Acts 1973–2005
ga: Sa bhreis ar sin tá tréimhse faoi leith leagtha síos sa dlí nach mór a thabhairt ar a laghad mar fhógra

source: In order to be entitled to the statutory minimum, you must have been working for your employer for at least 13 weeks
ga: Ní mór duit a bheith ag obair don fhostóir ar feadh 13 seachtain ar a laghad le bheith i dteideal an bhunthréimhse reachtúil fógra scoir a fháil

source: Minimum period of notice
ga: Tréimhse íosta do fhógra scoir

source: The amount of notice you are entitled to by law will depend on how long you have been working for your employer
ga: Braitheann an tréimhse ama dleathúil le fógra scoir a thabhairt duit ar an méid ama atá caite agat ag obair don fhostóir

source: Duration of employment Minimum notice
ga: │Fad seirbhíse │Bunthréimse Fhógra Scoir │

source: 13 weeks to 2 years 1 week
ga: │13 seachtain go 2 Bhliain │Seachtain │

source: 2 years to 5 years 2 weeks
ga: │2 Bhliain go 5 Bhliain │2 sheachtain │

source: 5 years to 10 years 4 weeks
ga: │5 Bhliain go 10 mBliana │4 sheachtain │

source: 10 years to 15 years 6 weeks
ga: │10 mBliana go 15 Bliana │6 seachtain │

source: 15 years or more 8 weeks
ga: │15 Bliana nó níos mó │8 seachtain │

source: While the notice entitlements under your contract of employment can exceed the minimim periods above, any provision for notice in your contract for less then the above is invalid
ga: Cé gur féidir teidlíocht a bheith agat de thoradh do chonradh fostaíochta go dtabharfaí fógra níos faide duit ná na híosthréimhsí thuas, má tá foráil ann go dtabharfar fógra níos giorra ná sin duit níl sé sin bailí

source: This essentially means that while your contract of employment can set down that you will receive a greater amount of notice than the law states above, you cannot get less, even if your contract says this
ga: Is éard a chiallaíonn sé sin ná go bhféadfaidh do chonradh fostaíochta a shocrú go dtabharfar fógra níos faide duit ná mar atá leagtha síos sa dlí, ní féidir fógra níos giorra a thabhairt duit, fiú má deir sé é i do chonradh

source: Payment instead of notice
ga: Pá in áit fhógra scoir

source: You may be required to work the notice period or you may accept payment in lieu of notice, if offered
ga: D'fhéadfadh sé go mbeadh ort oibriú ar feadh na tréimhse ina bhfuil fógra scoir tugtha duit nó d'fhéadfadh sé go mbeifeá sásta íocaíocht a fháil in áit fhógra scoir, má ofráiltear é sin duit

source: Payment in lieu of notice means that you will not have to work for the period between receiving notice and the ending of your employment, but you will get the same amount of wages that you would have received, had you worked
ga: Má fhaigheann tú íoctha in áit fhógra scoir ciallaíonn sin nach mbeidh ort oibriú sa tréimhse idir an fógra scoir a fháil agus deireadh a theacht le do chuid fostaíochta

source: This payment is not regarded as wages or salary but as compensation for loss of employment, which may qualify for tax relief
ga: Ach gheobhaidh tú an méid céanna tuarastail agus dá mbeadh faighte agat dá mbeifeá tar éis na tréimhse sin a oibriú

source: However, if your contract of employment provides for a payment of this kind on termination of the contract or if you work for the period of notice, you pay tax and PRSI in the normal way
ga: Ní mheastar an íocaíocht seo mar phá nó tuarastal ach mar chúiteamh nuair a chailltear fostaíocht. Ciallaíonn sé go mbeadh sé díolmhaithe ó cháin agus MSU (ní íocfá IMAT uirthi)

source: If you get payment in lieu of notice you are considered to be unemployed and available for work during this period
ga: Má fhaigheann tú íocaíocht in áit fhógra scoir, meastar gur dífhostaithe agus ag fáil d'obair thú ar feadh na tréimhse seo

source: This means that you can claim a jobseeker’s payment
ga: Ciallaíonn sé gur féidir leat íocaíocht cuardaitheora poist a éileamh

source: You cannot claim a jobseeker’s payment for any day that you are receiving holiday pay (see below)
ga: Ní féidir leat éileamh íocaíocht cuardaitheora poist le haghaidh aon lá ina bhfuil tú ag fáil saoire pá (féach thíos)

source: If you are accepting payment in lieu of notice, the date on your P45 is the date that you physically leave the job
ga: Má tá tú ag glacadh le híocaíocht in ionad fógra, is ionann an dáta ar do P45 agus an dáta a d’fhág tú do phost go fisiciúil

source: This allows you to claim social welfare benefits
ga: Ceadaíonn sin duit sochair leasa shóisialaigh a éileamh

source: However, the P45 does not prove the termination date of your employment for the purposes of employment law
ga: Ní cruthúnas é do P45 ar dháta foirceannta do fhostaíocha chun críocha dhlí na fostaíochta áfach

source: Under section 7 of the Minimum Notice and Terms of Employment Act 1973, if you accept payment in lieu of notice, then the date of termination of your employment is the date on which notice (if it had been given) would have expired
ga: Faoi alt 7 den Acht um Fhógra Íosta agus Téarmaí Fostaíochta 1973, má ghlacann tú le híocaíocht in ionad fógra, is ionann dáta foirceannta d’fhostaíochta agus agus an dáta ar a rachfadh fógra (dá mbeadh sin tugtha) in éag

source: During your period of notice you should receive your normal pay
ga: Ba cheart duit a fháil íoctha mar is gnáth i rith na tréimhse fhógra scoir

source: This also applies if you are paid in lieu of notice
ga: Tá sé seo amhlaidh fiú má fhaigheann tú íoctha in áit oibriú sa tréimhse fhógra scoir

source: Waiving your right to notice
ga: Do cheart chun fógra a tharscaoileadh

source: Employment legislation sets down that if an employer and an employee agree, the employee can waive their right to notice
ga: Leagtar síos sa reachtaíocht fostaíochta go bhféadann fostaí a gceart chun fógra a tharscaoileadh má aontaíonn fostóir agus fostaí leis

source: In addition, where the employer and employee agree, the employer can pay the employee in lieu of notice
ga: Ina theannta sin, áit a n-aontaíonn an fostóir agus an fostaí, féadann an fostóir íocaíocht a thabhairt don fhostaí in áit fógra

source: This right is set down in Section 7 of the Minimum Notice and Terms of Employment Act 1973
ga: Tá an ceart sin leagtha síos in Alt 7 den Acht um Fhógra Íosta agus Téarmaí Fostaíochta 1973

source: Your employer may dismiss you without notice for serious misconduct, although you can contest whether your employer was justified in such action
ga: Is féidir le do fhostóir deireadh a chur le do chuid fostaíochta ar chúis a bhaineann le mí-iompar tromchúiseach, ach is féidir leat achomharc a lorg ina choinne má cheapann tú nach raibh cúis mhaith ag an bhfostóir é sin a dhéanamh

source: If you lose your job you have certain rights and entitlements including the right to be paid for work you have done
ga: Má chailleann tú do phost tá cearta agus teidlíochtaí áirithe agat lena n-áirítear an ceart íocaíocht a fháil as aon obair curtha i gcrích agat

source: If you have not been paid by the date of dismissal or if you are still owed some wages, you have a legal entitlement to be paid for your work
ga: Mura bhfuil tú íoctha roimh dháta an dífhostaithe nó má tá roinnt pá dlite duit fós, tá tú i dteideal go dlíthiúil a bheith íoctha as do chuid oibre

source: Holiday pay: If your employment is ending, you are entitled to receive a payment for annual leave which you have earned but not taken
ga: Pá saoire: Má tá deireadh ag teacht le do chuid fostaíochta, tá tú i dteideal pá a fháil mar íocaíocht le haghaidh saoire bhliantúil atá tuillte agat ach nár thóg tú

source: The payment should equal the amount that would have been paid had the annual leave been taken
ga: Ba chóir an pá seo a bheith cothrom leis an méid a d’íocfaí leat dá dtógfá an tsaoire bhliantúil

source: The ending of employment is the only situation where it is legal to pay an employee instead of giving annual leave
ga: Is é an t-aon cás ina bhfuil sé dleathach fostaí a íoc in áit saoire bhliantúil a thabhairt dó nó di ná nuair atá deireadh á chur lena f(h)ostaíocht

source: Public holiday: If your employment stops during the week ending on the day before a public holiday and you have worked for your employer for the previous 4 weeks, you should receive an additional day's pay for the public holiday
ga: Saoire phoiblí: Má thagann deireadh le d’fhostaíocht sa tseachtain dar críoch lá roimh saoire phoiblí, agus má bhí tú ag obair le d’fhostóir i rith na 4 seachtaine roimhe sin, ba chóir go bhfaighfeá pá lae breise le haghaidh na saoire poiblí sin

source: This also applies to part-time employees who have established a right to the public holiday by working at least 40 hours in the previous 5 weeks
ga: Baineann sé seo le fostaithe páirtaimseartha a chruthaigh ceart don tsaoire phoiblí dóibh féin trí 40 uaire oibre a dhéanamh sna 5 seachtaine roimhe sin

source: Your employer is responsible for giving you your proper notice
ga: Tá sé de dhualgas ar an bhfostóir fógra scoir cuí a thabhairt duit

source: If you have difficulty in securing your notice entitlement or if there is a dispute about pay you are owed, your payslip or pay for annual leave you can refer a complaint to the Workplace Relations Commission within 6 months of the dispute or complaint occurring
ga: Má bhíonn aon deacracht agat do theidlíocht fhógra a bhaint amach nó má tá aon díospóid faoi phá dlite duit, do phádhuille nó pá le haghaidh saoire bhliantúil is féidir do chás a chur chuig an gCoimisiún um Chaidreamh san Áit Oibre laistigh de 6 mhí

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: The time limit may be extended for up to a further 6 months, but only where there is reasonable cause which prevented the complaint being brought within the normal time limit
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama

source: For further information on your employment rights contact the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Tá tuilleadh faisnéise ar fáil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are not given a P45 when you leave your job you should first ask your employer for it
ga: Mura dtugtar P45 duit nuair a fhágann tú do phost ba chóir duit a iarraidh ar d’fhostóir ar dtús í a thabhairt duit

source: If the employer does not supply it you should contact your tax office
ga: Ba chóir dul i dteagmháil le d’oifig chánach mura gcuireann an fostóir ar fáil é

source: Revenue will contact the employer and obtain your P45 for you
ga: Rachaidh na Coimisinéirí Ioncaim i dteagmháil le d’fhostóir agus gheobhaidh siad do P45 duit

source: If you have started a new job, Revenue will send you a new tax credit certificate so you will not have to pay emergency tax in your new job. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Cuirfidh an Coimisinéirí Ioncaim teastas nua creidmheasa cánach chugat má tá tú ag obair i bpost nua chun nach mbeidh ort cáin éigeandála a íoc
